src/CFD/fixedTopWall3/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    upperWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       4660;
    }
    lowerWall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          120;
        startFace       4780;
    }
    inlet
    {
        type            patch;
        nFaces          20;
        startFace       4900;
    }
    outlet
    {
        type            patch;
        nFaces          20;
        startFace       4920;
    }
    frontAndBack
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          4800;
        startFace       4940;
    }
)

// ************************************************************************* //
